[SEACAD]
##TIP
IDC_STATIC_WWW                     =   http://www.kbflaser.com/
SEA_MALLOC_FAIL                    =   申请内存失败
IDS_CHOOSE_COLOR                   =   请先选择颜色
IDS_SAVE_PARAM_OK                  =   参数已保存
IDS_SAVE_FILE_OK                   =   数据已保存
IDS_MSG_MRAK_FLY                   =   请先停用飞行标刻

##DLG－ABOUT
DLG_ABT_CAD                        =   关于SeaCad
IDC_STATIC_VER                     =   SeaCAD 3.0.2.3.41201版
IDC_STATIC_WARN                    =   警告:版权所有 (C) 2013-2020
COMPANY_BSL                        =   深圳锦帛方激光科技有限公司
APP_ISRUNING                       =   本软件已经在运行中
QUIT                               =   退出
TIP_IDOK                           =   确定
IDCANCEL                           =   取消
##菜单
IDS_MENU_FILE                      =   文件(&F)
IDS_MENU_FILE_NEW                  =   新建(&N)
IDS_MENU_FILE_OPEN                 =   打开(&O)
MENU_FILE_SAVE                     =   保存(&S)
MENU_FILE_SAVE_AS                  =   另存为(&A)...
MENU_FILE_PRINT                    =   打印 Ctrl+P
MENU_FILE_SCANIMAGE                =   获取扫描图象(&m)...
MENU_FILE_SYSTEM                   =   系统参数(&P)...
MENU_FILE_IMGLIB                   =   常用图库(&L)...
MENU_FILE_MRU_FILE1                =   最近文件
IDS_MENU_FILE_CLOSE                =   关闭(&C)
IDS_MENU_FILE_EXIT                 =   退出(&E)

##
MENU_EDIT                          =   编辑(&E)
MENU_EDIT_UNDO                     =   撤销(&U)
MENU_EDIT_REDO                     =   恢复(&R)
MENU_EDIT_CUT                      =   剪切(&T) Ctrl+X
MENU_EDIT_COPY                     =   复制(&C) Ctrl+C
MENU_EDIT_PASTE                    =   粘贴(&P)
MENU_EDTI_ALL                      =   全选(&A) Ctrl+A
MENU_EDIT_UNALL                    =   反选
MENU_EDIT_DEL                      =   删除
MENU_EDIT_COMBINE                  =   组合     Ctrl+L
MENU_EDIT_UNCOMBINE                =   分离组合 Ctrl+K
MENU_EDIT_GROUP                    =   群组     Ctrl+G
MENU_EDIT_UNGROUP                  =   分离群组 Ctrl+U
MENU_EDIT_TOCURVE                  =   转为曲线  Ctrl+Q
MENU_EDIT_TODASHED                 =   转为虚线
MENU_EDIT_UNGROUPTEXT              =   分离文本
MENU_EDIT_HATCH                    =   填充      Ctrl+H


MENU_DRAW                          =   绘制(&D)
MENU_DRAW_POINT                    =   点(&P)
MENU_DRAW_CURVE                    =   曲线(&R)
MENU_DRAW_LINE                     =   直线(&L)
MENU_DRAW_RECT                     =   矩形(&R)
MENU_DRAW_CIRCLE                   =   圆(&C)
MENU_DRAW_ELLIPSE                  =   椭圆(&E)
MENU_DRAW_POLY                     =   多边形(&G)
MENU_DRAW_TEXT                     =   文本(&T)
MENU_DRAW_PICF                     =   图片文件(&T)
MENU_DRAW_BMPFILE                  =   位图文件(&B)
MENU_DRAW_VECTORFILE               =   矢量文件(&V)
MENU_DRAW_TIMER                    =   延时器(&M)
MENU_DRAW_INPUT                    =   输入端口(&I)
MENU_DRAW_OUTPUT                   =   输出端口(&O)
MENU_DRAW_ENCODERDIST              =   编码器移动距离
MENU_DRAW_SPIRAL                   =   螺旋线


MENU_MODI                          =   修改(&M)
MENU_MODI_ARRAY                    =   阵列
MENU_MODI_TRANSFORM                =   变换
MENU_MODI_MOD                      =   造型
MENU_MODI_TRIM                     =   修剪
MENU_MODI_BKCRSPT                  =   去除交叉点
MENU_MODI_AUTOCON                  =   自动连接
MENU_MODI_RESORT                   =   排序
MENU_MODI_ALIGN                    =   对齐

MENU_ALIGN_BOTTOM                  =   底边对齐
MENU_ALIGN_CENTER                  =   中心点对齐
MENU_ALIGN_CENTER_HOR              =   水平中线对齐
MENU_ALIGN_CENTER_VER              =   垂直中线对齐
MENU_ALIGN_LEFT                    =   左边对齐－
MENU_ALIGN_RIGHT                   =   右边对齐
MENU_ALIGN_TOP                     =   顶边对齐

##
MENU_VIEW                          =   查看(&V)
MENU_VIEW_SYS                      =   系统菜单栏
MENU_VIEW_WID                      =   界面窗口栏
MENU_VIEW_TOOLBAR                  =   系统工具栏(&T)
MENU_VIEW_ZOOMBAR                  =   视图工具栏(&Z)
MENU_VIEW_DRAWBAR                  =   绘制工具栏(&D)
MENU_VIEW_ZOOM                     =   放缩工具栏
MENU_VIEW_ASS                      =   辅助工具栏
MENU_VIEW_ALL                      =   对齐工具栏
MENU_VIEW_OBJ                      =   对象列表栏
MENU_VIEW_ENTPROP                  =   对象属性栏
MENU_VIEW_MAKPAR                   =   标刻参数栏
MENU_VIEW_LAS                      =   激光操作栏
##
MENU_VIEW_STATUS_BAR               =   状态栏(&S)
ENTPROP                            =   对象属性
MENU_VIEW_RULER                    =   显示标尺
MENU_VIEW_GRID                     =   显示网格
MENU_VIEW_GUILD                    =   显示辅助线
MENU_VIEW_PATH                     =   显示路径
MENU_VIEW_SNAPGRID                 =   捕捉网格
MENU_VIEW_SNAPGUILD                =   捕捉辅助线
MENU_VIEW_SNAPOBJECT               =   捕捉对象
MENU_VIEW_TRAK                     =   轨迹预览
MENU_VIEW_IOSTATE                  =   IO状态
MENU_VIES_GENCODE                  =   生成Gcode

##
MENU_SPECIAL                       =   特殊(&S)
MENU_SPE_CHGTXT                    =   改变文本
MENU_SPE_VARTXT                    =   序列号文本
MENU_SPE_SNEXTADD                  =   序列号递增
MENU_SPE_SNEXTDEL                  =   序列号递减
MENU_SPE_SNEXTRESET                =   序列号复位

##
MENU_LASER                         =   激光(&L)
MENU_LAS_ANGLEROTATE               =   旋转角度标刻
MENU_LAS_ANGLEROTATE2              =   360度旋转角度标刻
MENU_LAS_EXTAXI                    =   扩展轴标刻
MENU_LAS_RINGMARKF5                =   戒指标刻(F5)
LASERREADYIO                       =   激光准备好端口
##
MENU_CALIB                         =   振镜校正(&C)
IDM_INIT_CALIB                     =   初值校正
IDM_LSM_CALIB                      =   拟合校正
##
MENU_HELP                          =   帮助(&H)
MENU_ABOUT                         =   关于SEACAD(&A)
MENU_CHA_VIEW                      =   更改外观
MENU_OF2003                        =   Office2003银色
MENU_OF2007                        =   Office2007银灰
MENU_OF2007BLU                     =   Office2007蓝色
MENU_OF2010H                       =   Office2010褐色
MENU_OF2010Y                       =   Office2010银色

##
MENU_POP_LOCK                      =   锁定对象
MENU_POP_UNLOCK                    =   解除所选对象
MENU_POP_PRE                       =   移前一位
MENU_POP_AFT                       =   移后一位
MENU_POP_TOP                       =   移后顶端
MENU_POP_BOT                       =   移后尾部
MENU_POP_FINISH                    =   结束(&F)
MENU_POP_COOR                      =   输入坐标(&I)
MENU_POP_CLOSEFINISH               =   闭合结束(&C)
MENU_POP_MODIFYCOLOR               =   修改颜色
MENU_POP_MODIFPARAM                =   修改参数
MENU_POP_APPLYTOPICK               =   应用到选择对象
MENU_POP_SETDFT                    =   设为默认笔
MENU_POP_SETMARK                   =   标刻开关


##DLG_ROT0
DLG_ROT0_TITLE                     =   旋转角度标刻
DLG_ROT0_EXT_LJ                    =   零件
DLG_ROT0_CURTM                     =   当前时间
DLG_ROT0_ANGLE                     =   当前角度
DLG_ROT0_CNT                       =   加工总数
DLG_ROT0_TOTAL                     =   总时间
DLG_ROT0_MVRT                      =   运动角度
DLG_ROT0_CTWK                      =   连续加工
DLG_ROT0_SELWK                     =   选择加工
IDC_CHK_MARK_WHOLE_SHAPE           =   图形整体标刻
IDC_STATIC_GRAPH_GAP               =   图形间距
DLG_ROT0_BTN_RDLT                  =   红光指示
DLG_ROT0_BTN_MK                    =   标刻
DLG_ROT0_BTN_PARA                  =   参数
DLG_ROT0_BTN_EXIT                  =   退出
IDS_NO_MARK                        =   打标未开始......
IDS_MARK_FINISH                    =   打标结束
IDS_MARK                           =   标刻
IDS_MARK_CURRENT				   =   标刻当前块



##DLG_ANGLERORATE
IDC_RATE_TITLE                     =   扩展轴标刻
IDC_STATIC_RT_LJ                   =   零件
IDC_STATIC_CUR                     =   当前时间
IDC_STATIC_RATE_CNT                =   加工总数
IDC_STATIC_RATE_TOTAL              =   总时间
IDC_STATIC_STEP                    =   运动步长
IDC_STATIC_SPLIT                   =   分割尺寸
IDC_BUTTON_AXIS_DIA                =   工件直径
IDC_STATIC_MM                      =   毫米
IDC_FOCUSLENGTH                    =   焦距

##DLG_旋转标刻2
IDC_RATE2_TILTLE                   =   360度旋转角度标刻
IDC_STATIC_ROT2_INC                =   增量
IDC_CHECK_360DG                    =   360度标刻
IDC_CHECK_TOTALNUM                 =   总数

##自动连接对话框
DLG_AUTO_CNN_TITLE                 =   自动连接
##改变文本话框                     =
DLG_CHGTXT_TITLE                   =   改变文本
IDC_STATIC_CHETXT                  =   源文本
IDC_STATIC_TXTDEST                 =   变换后的文本

##高级标刻参数
IDC_STATIC_ADV_JP                  =   跳转速度
IDC_STATIC_JPDELAY                 =   跳转位置延时
IDC_STATIC_JPDT_DELAY              =   跳转距离延时
IDC_STATIC_EPOFF                   =   末点补偿
IDC_STATIC_ACDT                    =   加速距离
IDC_STATIC_MKTM                    =   打点时间
IDC_PULSE_POINT_MODE               =   矢量打点模式
IDC_STATIC_PERPULSE                =   每个点脉冲数
IDC_STATIC_MMS                     =   毫米/秒
IDC_STATIC_UM                      =   微米
##IDC_STATIC_UM2                   =   微米
IDC_STATIC_MS                      =   毫秒
IDC_WOBBLE                         =   抖动
IDC_STATIC_DIA                     =   直径
IDC_STATIC_DIT                     =   间距
IDC_END_ADD_POINTS                 =   末尾加点
IDC_STATIC_NUM                     =   数目
IDC_STATIC_DITADV                  =   距离
IDC_STATIC_MKTIME                  =   打点时间
IDC_STATIC_MKCNT                   =   打点次数

##常用图库DLG
IDC_STATIC_LIB_NAME                =   图库名称
IDC_STATIC_LIB_PRE                 =   图片预览
IDC_STATIC_LIB_TIP                 =   提示:按住鼠标左键选择需要的图形然后拖拉移动到工作区间
IDC_BUTTON_NEWLIB                  =   新建图库
IDC_BUTTON_DELLIB                  =   删除图库
IDC_BUTTON_ADDIMG                  =   加入图片
IDC_BUTTON_DELIMG                  =   删除图片
IDS_COMMON_IMG                     =   Common Image

##输入端口窗口                     =
DLG_INPUT_TITLE                    =   输入端口
IDC_STATIC_IOCTL                   =   输入输出控制

##IO 窗口
DLG_IO_TITLE                       =   IO
IDC_STATIC_INPUT_IO                =   输入端口
IDC_STATIC_OUT_IO                  =   输出端口

##控制对话框                       =
IDS_REDLIGHT                       =   红光指示中....
IDS_MARKING_FLY                    =   飞行打标标刻中....
IDS_MARKING_INPUT                  =   输入端口检测打标中...
IDS_TMP_HIGH                       =   激光器温度过高，如要继续打标，可在参数中设置不检测激光器状态
IDS_LASER_CLOSED                   =   激光器已关闭,如要继续打标，可在参数中设置不检测激光器状态
IDS_LASER_ABNORMAL                 =   激光器：mo（主振荡器）异常,如要继续打标，可在参数中设置不检测激光器状态
IDS_COMMON_IMG                     =   常用图形
IDS_STATE_ERROR                    =   激光器状态检测错误，请在参数中设置不检测激光器状态
IDS_QUIT_MARK                      =   当前正在打标，确定退出打标吗?
IDS_COM_ERROR                      =   com无法进行通讯，请检测com状态
##从参数库取参数对话框             =
DLG_PUT_PARA_TITLE                 =   从参数库取参数
IDC_BUTTON_SAVEAS                  =   当前参数另存为
IDC_BUTTON_DEL_SELECT              =   删除被选择的参数
IDC_BUTTON_SET_DEFAULT             =   参数设为默认值



##加入图片对话框                   =
DLG_PIC_ATT_TITLE                  =   加入图片
IDC_STATIC_PIC_NAME                =   请输入图像名称

##加入图库对话框                   =
DLG_PIC_LIB_ATT_TITLE              =   加入图库
IDC_STATIC_LIB_PIC_NAME            =   请输入图库名称

##戒指标刻窗口                     =
DLG_RING_MK_TITLE                  =   戒指标刻
IDC_STATIC_RING_LJ                 =   零件
IDC_STATIC_RING_CUR                =   当前时间
IDC_STATIC_RING_CNT                =   加工总数
IDC_STATIC_RING_TIME               =   总时间
IDC_CHECK_SELECT                   =   选择加工
IDC_CHECK_RING_INNER               =   戒指内环
IDC_STATIC_RING_DIA                =   戒指直径
IDC_STATIC_RING_THK                =   戒指厚度
IDC_STATIC_RING_DEGREE             =   度
IDC_STATIC_RING_STEP               =   移动步长
IDC_CHK_MONITOR_INPORT             =   检测输入口信号


##配置参数对话框
DLG_CFG_PARA_TITLE                 =   配置参数
IDS_LASER_RING_PARAM_EXT           =   扩展轴
##
IDC_CHK_REV_ROT                    =   反转
IDC_CHK_ROTATE                     =   旋转轴
IDC_STATIC_EXT_MULSE               =   每转脉冲数
IDC_STATIC_EXT1                    =   脉冲
IDC_STATIC_MININD                  =   最小坐标
IDC_STATIC_MAXIND                  =   最大坐标
IDC_STATIC_PULPERSEC               =   脉冲/秒
IDC_STATIC_PAREXT_MINV             =   最小速度
IDC_STATIC_PAREXT_MAXV             =   最大速度
IDC_STATIC_PAREXT_ACT              =   加速时间
IDC_STATIC_PAREXT_OFMV             =   补偿移位
IDC_STA_RING_COMP_BL               =   比例补偿
IDC_STA_RING_COMP_JX               =   间隙补偿
IDC_STA_RING_COMP_CW               =   错位补偿
IDC_CHECK_FINISH_GOTOO_RI          =   加工结束回起始点
IDC_STATIC_WKFRE                   =   电机运行速度
IDC_CHECK_ZERO                     =   零点
IDC_STATIC_PAREXT_ZERO             =   回零速度
IDC_STATIC_PAREXT_ZESUP            =   回零超时
IDC_STATIC_SED                     =   秒
IDC_CHECK_ACCURATE                 =   精确回零

##按笔号选择DLG
DLG_SEL_BY_PEN_TITLE               =   按笔号选择对象
IDS_PEN_ID                         =   笔号
IDS_PEN_COLOR                      =   颜色

IDS_STEP_DIST                      =   步距(mm)
IDS_SPEED                          =   速度(mm/s)
IDS_LASER_POWER                    =   功率(%)
IDS_SAVE_CURRENT                   =   保存当前设置为缺省配置，成功!
IDS_PULSELOWMAXFREQ                =   脉冲频率小于最小频率
IDS_MINFREQ                        =   最小频率

IDS_PULSEGREATEMAXFREQ             =   脉冲频率大于最大频率
IDS_MAXFREQ                        =   最大频率
IDS_SPDLOWMINSPD                   =   速度小于最小速度！
IDS_MINSPD                         =   最小速度
IDS_SPDGREATEMAXSPD                =   速度大于最大速度！
IDS_MAXSPD                         =   最大速度
IDS_OPEN_SHX                       =   请先打开一个SHX文件
IDS_OPEN_DXFONT_ERR                =   打开单线字体失败:
IDS_DRAW_SPIRAL_ERR                =   无法生成螺旋线
IDS_CREATE_SPIRAL_ERR              =   边框尺寸太小，无法生成螺旋线
IDS_OPEN_PICTURE_ERR               =   打开图片文件失败
IDS_GET_PICFILE_ERROR              =   调用图片文件失败
IDS_PICTYPE_ERR                    =   不是正确的图片文件。
IDS_ONLY_DEAL_GRAYPIC              =   只能处理灰度图片
IDS_INIT_BARERR                    =   条码初始化失败。
IDS_LOAD_FONT                      =   字体列表仍在加载中，请稍候再试
IDS_SELECT_ENTITY                  =   请先选择一个外框对象
IDS_GAP_TIP                        =   间距不应小于0.01
IDS_MARK_MAP_ERR                   =   无法打标位图
IDS_PARSE_HATCH_ERR                =   解析填充图形出错
IDS_COPY                           =   副本
IDS_OBJECT_LIST                    =   对象列表栏
IDS_WELDTO                         =   焊接于...
IDS_TRIMTO                         =   修剪于...
IDS_INTERSECTTO                    =   交叉于...
IDS_NAME                           =   名称
IDS_TYPE                           =   类型
IDS_MARK_TYPE                      =   标记
IDS_TRUE_TYPE                      =   TrueType字体
IDS_JXF_FONT                       =   单线字体
IDS_BAR_FONT                       =   条形码字体
IDS_ADMIN                          =   管理者
IDS_DESIN                          =   设计者
IDS_YEAR                           =   年
IDS_MONTH                          =   月
IDS_DAY                            =   天
IDS_LOCK                           =   锁
IDS_PEN_ID                         =   笔号
IDS_PEN_COLOR                      =   颜色
IDS_PEN_SWITCH                     =   开关
IDS_ADVANCE                        =   高级...
IDS_APPLY_TO_DEFAULT               =   保存为默认参数
IDS_LOAD_DEFAULT                   =   加载默认参数
IDS_TYPENAME_SCREWLINE             =   螺旋线
IDS_AUTOSAVE_CHECK                 =   每
IDS_AUTOSAVE_STATIC_MINUTE         =   分钟，自动保存
IDR_TOOLBAR_DRAW                   =   显示或隐藏绘图工具栏
IDS_TIPS_ZOOM_MAX                  =   显示或隐藏放缩工具栏
IDS_TIPS_ROTATE_RANGLE             =   旋转中心超出范围！
IDS_SETTING_TREE_GENERAL           =   常规
IDS_SETTING_TREE_COLOR             =   颜色
IDS_SETTING_TREE_WORKPLACE         =   工作区间
IDS_SETTING_TREE_AUTOSAVE          =   自动保存
IDS_SETTING_TREE_MOVEROTATE        =   移动旋转
IDS_SETTING_TREE_PLUGMANAGE        =   插件管理
IDS_SETTING_TREE_USER              =   用户管理
IDS_SETTING_TREE_LANGUAGE          =   语言
IDS_SET_G_UNIT_TYPE                =   单位类型
IDS_SET_G_PASTE_X                  =   水平粘贴偏移
IDS_SET_G_PASTE_Y                  =   垂直粘贴偏移
IDS_SET_G_GRID                     =   网格
IDS_SET_G_SHOWGRID                 =   显示网格
IDS_SET_G_GRID_DISTANCE            =   网格间距
IDS_SET_G_I_MASK                   =   输入IO掩码
IDS_SET_G_O_MASK                   =   输出IO掩码
IDS_SET_G_MARKING_MUTEX            =   使能标刻互斥量
IDS_SET_G_EXECUTE_START            =   当主程序启动时，运行程序
IDS_SET_G_EXECUTE_FINISH           =   当主程序关闭时，运行程序
IDS_TYPENAME_ELLIPSE               =   椭圆(弧)
IDS_SAVE_FINISH                    =   保存完毕
IDS_TYPENAME_ELLIPSEARC            =   椭圆弧
IDS_TYPENAME_CIRCLE                =   圆(弧)
IDS_STRAT_DEGREE                   =   开始角度
IDS_END_DEGREE                     =   结束角度
IDS_DEGREE                         =   度
IDS_TYPENAME_RECTANGLE             =   矩形
IDS_ROUND_STEP                     =   圆角程度
IDS_ROUND_ALL                      =   所有边圆角
IDS_TYPENAME_BEZIER                =   曲线
IDS_INCH                           =   英寸
IDS_MM                             =   毫米
IDS_BK                             =   背景
IDS_CENTERLINE                     =   中心线
IDS_TYPENAME_TEXT                  =   文本
IDS_TYPENAME_PICTURE               =   图片
IDS_SHOW_WORKSPACE                 =   显示工作区间
IDS_SHOW_ROUND                     =   显示圆形区间
IDS_SHOW_CROSS                     =   显示中心十字线
IDS_LOWERLEFT                      =   左下角
IDS_SIZE                           =   尺寸
IDS_HEIGHT                         =   高度
IDS_WIDTH                          =   宽度
IDS_FUNC_ERROR                     =   应该在派生类中实现此函数
IDS_CHOOSE_COLOR                   =   请先选择颜色
IDS_EXIT_ROTATE                    =   当前正在打标，确定退出旋转打标吗?
IDS_SPLIT_OUTRANGE                 =   分割尺寸必须小于工件半径!
IDS_ROTARYMARK                     =   扩展轴标刻
IDS_CURNUMGREATETOTALNUM           =   当前加工数已经大于加工总数，请复位当前加工数后再加工！
IDS_TIPS_TURN_D2                   =   切换至列表属性栏
IDS_ERR_DOOROPEN                   =   安全门被打开，请关闭安全门!
IDS_CHANGE_TEXT                    =   请输入要切换的文本！该值不能为空！
IDS_PSWINCORRECT                   =   密码不正确，请重新输入!
IDS_QUIT_MARK                      =   当前正在打标，确定退出打标吗?
IDS_SAVE_CURRENT                   =   保存当前设置为缺省配置，成功!
IDS_PULSELOWMAXFREQ                =   脉冲频率小于最小频率
IDS_MINFREQ                        =   最小频率
IDS_PULSEGREATEMAXFREQ             =   脉冲频率大于最大频率
IDS_MAXFREQ                        =   最大频率
IDS_SPDLOWMINSPD                   =   速度小于最小速度！
IDS_MINSPD                         =   最小速度
IDS_SPDREATEMAXSPD                 =   速度大于最大速度！
IDR_TOOLBAR_ASSISTANT              =   辅助工具栏。图形锁定、解锁，置于原点等。
IDS_TIPS_TURN_D1                   =   切换至标刻参数栏
IDS_MK_OPER                        =   标刻操作栏

IDS_OPEN_COM_ERR                   =   打开串口失败！
IDS_PWD_ERROR                      =   两次输入的密码不一致
IDS_USER_EXIST                     =   您输入的用户名已经存在！请重新输入一个用户名！
IDS_INPUT_USER                     =   请输入一个用户名！
IDS_INVALID_BAR                    =   无法支持的条码内容，请重新设置条码内容！
IDS_TIPS_ZOOM_MIN                  =   尺寸 <0.001mm 超出精度！
IDS_MARKING                        =   正在标刻中......
IDS_STOP_MARK                      =   停止标刻
IDS_MARK_STOPPED                   =   打标已经停止！
IDS_POWER_ON                       =   电源开
IDS_POWER_OFF                      =   电源关
IDS_STEP_MARK                      =   标刻步距(毫米)
IDS_CURRENT                        =   电流(A)
IDS_SPEED                          =   速度(毫米/秒)
AFX_IDS_APP_TITLE                  =   SeaCad
IDS_APP_TITLE                      =   LMC1
IDS_INPUT_NUM                      =   请键入一个数字
IDS_TIP_MAX_DA                     =   最大DA值为：4096
IDS_DISTORTION                     =   参数范围为0.8~1.2
IDS_LINKERROR                      =   无法连接到激光控制卡，请检测控制卡连接状态！
IDS_PAR_CAL_ERRPR                  =   参数计算错误
IDS_FLY_MARK_PARA_CAL              =   飞行参数计算
IDS_PWD_ERROR_                     =   密码错误！
IDS_LASER_OUT                      =   按确定将输出激光，你确认要输出激光吗？

IDS_WARING                         =   警告
IDS_PORT_ERROR                     =   请注意输出端口有冲突！请重新选择！
IDS_PWD_CON_EEROR                  =   两次输入的密码不一致，请重新输入！
IDS_ENABLE_POWER                   =   使能功率模拟口输出
IDS_POWER_MAP                      =   功率映射
IDS_ENABLE_ANGLOG_OUT              =   使能电流输出
IDS_ANALOG_MAP                     =   电流映射
IDS_LASER_ON                       =   开激光
IDS_LASER_OFF                      =   关激光
IDS_LASER_TEST                     =   激光测试
IDS_CON                            =   新的飞行速度系数为：
IDS_USE_CON                        =   使用该系数请点击【确定】！
IDS_FIELD                          =   区域
IDS_LASER_CONTROL                  =   激光控制
IDS_PORT                           =   端口
IDS_OTHER                          =   其它
IDS_TYPENAME_INPUT                 =   输入端口
IDS_TYPENAME_OUTPUT                =   输出端口
IDS_TYPENAME_POLYGON               =   多边形
IDS_TYPENAME_COMBINE               =   组合
IDS_TYPENAME_POINT                 =   点
IDS_TYPENAME_DELAYEDTIMER          =   延时器

IDR_TOOLBAR_ALIGN                  =   显示或隐藏对齐工具栏
IDS_NEW_LIB_TIP                    =   请先建立图库，然后再保存图像！
IDS_INPUT_IMGNAME                  =   请输入图像名称
IDS_HAVEIMG_TIP                    =   指定的图像已经存在，请重新输入
IDS_INPUT_LIBNAME                  =   请输入图库名称
IDS_HAVELIB_TIP                    =   指定的图库已经存在!，请重新输入
IDS_PARAMNAMEEXIST                 =   参数名称已经存在！覆盖旧参数吗？
IDS_REALYAPPDEF                    =   你确认要应用当前参数为默认参数吗？
IDS_CHECK_LINK                     =   打标控制卡连接发生错误，请检测连接......
IDS_ENCRYPTION_ERR                 =   板卡加密认证失败
IDS_NO_OBJECT                      =   没有对象被选取
IDS_SELECT                         =   选取
IDS_OBJECT_SELECTED                =   对象被选取
IDS_OBJECT                         =   对象:
IDS_DEV_COR                        =   设备坐标
IDS_PAPER_COR                      =   图纸坐标
IDS_ZOOM_SCALE                     =   显示倍数

IDS_NOENTITY_SELECT                =   没有可加工的数据，请检查是否选择了加工对象
IDS_NOENTITY                       =   没有可加工的数据，请检查文件是否载入！
IDS_CACHE_FULL                     =   打标缓存已满，请检测达标卡状态!点击[确定]重试。
IDS_PLT_TIPS                       =   plt文件空格后应为数字或“+、-”号！
IDS_SELECT_ERR                     =   未选择正确的对象,请重新选择!
IDS_CANNOT_OPEN_FILE               =   文件无法打开!
IDS_PLT_INVALID_CHAR               =   PLT文件中有非法字符！
IDS_ENCODE_ERR                     =   硬件系统加密失败，系统将停止工作
IDS_VERSION_ERR                    =   软件版本和硬件系统不兼容！
IDS_ERROR                          =   错误
IDS_LINK_ERR                       =   无法连接打标控制卡，程序进入演示模式(不能打标)!
IDS_NOFONTS                        =   系统中无可用字体，请与管理员联系
IDS_INVALID_FONT                   =   无效的字体，换用别的字体。
IDS_ERR_BAR_TYPE                   =   无法查找的条码类型
IDS_OPEN_LINEFILE_ERR              =   打开单线文件失败:
IDS_TCP_LINK_ERR                   =   连接通讯服务器失败！
IDS_TYPENAME_CODEBAR               =   条码
IDS_TYPENAME_FILLED                =   填充
IDS_STATUS                         =   无选取

IDS_MOUSE_XY                       =   坐标
IDS_FILESAVE_STRING                =   是否保存当前文件？
IDS_FILESAVE_TITLE                 =   保存提示
IDS_TYPENAME_LINE                  =   直线
IDS_TYPENAME_POLYLINE              =   多直线段
IDS_TYPENAME_GROUP                 =   群组
IDS_SWITCH_ON                      =   开
IDS_SWITCH_OFF                     =   关

IDS_READY                          =   就绪
IDS_SNAP                           =   捕捉
IDS_GUID_LINE                      =   辅助线

## 密码对话框                      =
DLG_PWD_TITLE                      =   密码设置
IDC_STATIC_NAME                    =   用户名
IDC_STATIC_PWD                     =   密码
IDC_STATIC_CFMPWD                  =   确认密码

##Rotate Param Config and Axis check DLG        
IDD_DLG_ROTATE_CFG                 =   旋转参数配置与旋转轴检查(F4)
IDC_STATIC_ROT_STEP_ANGLE          =   移动角度

##旋转角度标刻参数设置DLG          =
DLG_ROT_ANG_TITLE                  =   旋转角度标刻参数设置

##输入参数名称DLG                  =
DLG_INPUT_PARA_TITLE               =   输入参数名称
##工件直径DLG                      =
DLG_WKDIA_TITLE                    =   工件直径

##转为虚线DLG                      =
DLG_TRAN_TITLE                     =   转为虚线
IDC_STATIC_LINELEN                 =   线长-L1
IDC_STATIC_LINEINTER               =   间隔-L2

##条形码 DLG                       =
DLG_BARCODE_TITLE                  =   条形码
IDC_STATIC_TEXT                    =   文本
IDC_CHECK_SHOW_TEXT                =   显示文本
IDC_STATIC_TXTHIT                  =   文本高度
IDC_STATIC_TEXTWID                 =   文本宽度
IDC_TEXT_OFFSETX                   =   文本X偏移
IDC_TEXT_OFFSETY                   =   文本Y偏移
IDC_TEXT_TEXTSPACE                 =   文本间距
IDC_CHECK_REVERT                   =   黑白反转
IDC_GRP_QUIET                      =   空白
IDC_STATIC_TOP                     =   顶部
IDC_STATIC_LEFT                    =   左边
IDC_STATIC_RIGHT                   =   右边
IDC_STATIC_BOTTOM                  =   底部
IDC_STATIC_HEIGHT                  =   条码高度
IDC_STATIC_STAWD                   =   标准模块宽度
IDC_STATIC_RATIO                   =   比例
IDC_STATIC_BAR                     =   条
IDC_STATIC_SPACE                   =   空
IDC_STATIC_PENID                   =   笔号
IDC_STATIC_FONT                    =   字体

##GCODE 对话框
DLG_CGODE_TITLE                    =   GCODE

##填充对话框                       =
DLG_FILL_TITLE                     =   填充
IDC_CHECK_ENABLE_OUTLINE           =   使能轮廓
IDC_CHECK_OUTLINE_FIRST            =   轮廓优先
IDC_RADIO_FILL_1                   =   填充1
IDC_RADIO_FILL_2                   =   填充2
IDC_RADIO_FILL_3                   =   填充3
IDC_CHECK_ENABLE                   =   使能
IDC_STATIC_TYPE                    =   类型
IDC_CHECK_COUNT_ALL                =   对象整体计算
IDC_CHECK_ROUND_INVERT             =   反转
IDC_CHECK_ALONG_BORDER             =   绕边走一次
IDC_CHECK_KEEP_SEPERATE            =   保留填充对象的独立
IDC_STATIC_ANGLE                   =   角度
IDC_GRP_MUTCP                      =   多图形运算
IDC_RADIO_EXECUTE                  =   默认
IDC_RADIO_EXECUTE_2                =   交集
IDC_RADIO_EXECUTE_3                =   并集
IDC_RADIO_EXECUTE_4                =   差集
IDC_STATIC_LISTDIST                =   线间距
IDC_CHECK_ARRANGE_EQUALLY          =   平均分布填充线
IDC_STATIC_EDG                     =   边距
IDC_STATIC_STARTOFFSET             =   开始偏移
IDC_STATIC_ENDOFFSET               =   结束偏移
IDC_STATIC_LINEREDUCTION           =   直线缩进
IDC_STATIC_NUMLOOPS                =   边界环数
IDC_STATIC_LOOPDIST                =   环间距
IDC_BUTTON_DEL                     =   删除填充
##路径文本DLG                      =
DLG_PATH_FONT_TITLE                =   路径文本
IDC_STATIC_BASEANG                 =   基准角度
IDC_CHECK_BASE                     =   角度范围
IDC_CHK_INVERT                     =   文字反排
IDC_CHK_ALLIG_TOP                  =   文字顶端对齐
##字体 DLG
DLG_FONT_TITLE                     =   字体
IDC_STATIC_ALLIGN                  =   对齐方式
IDC_RADIO_ALIGN_LEFT               =   左
IDC_RADIO_ALIGN_LEFT3              =   中
IDC_RADIO_ALIGN_LEFT2              =   右
IDC_CHECK_BOLD                     =   粗体
IDC_CHECK_ITALIC                   =   斜体
IDC_CHECK_EUQAL_WIDTH              =   使能等宽字符
IDC_STATIC_CH_WID                  =   字符宽度
IDC_STATIC_CHA_ANG                 =   字符角度
IDC_STATIC_CHA_INT                 =   字符间距
IDC_STATIC_LINE_INT                =   行间距
IDC_STATIC_CHA_HEI                 =   %   字符高度
IDC_STATIC_DEGREN                  =   度   (-89,89)
IDC_STATIC_DIR                     =   排列方向
IDC_RADIO_HORIZONTAL               =   水平
IDC_RADIO_VERTICAL                 =   垂直
IDC_CHECK_ROUND                    =   圆弧文本
IDC_STATIC_DIA_C                   =   圆半径
IDC_CHECK_INVERT                   =   文字反排
IDC_CHECK_UPSIDEDOWN               =   文字倒立
IDC_CHECK_LIMIT_ANGLE              =   角度范围限制
ID_BUTTON_APPLY                    =   应用

##输入坐标 DLG
DLG_INPUT_IND_TITLE                =   输入坐标

##用户选择 DLG                     =
DLG_USER_SEL_TITLE                 =   用户选择
IDC_STATIC_USER                    =   用户
IDC_STATIC_PWD                     =   密码

##标刻控制--暂时不用               =

IDC_BUTTON_MARK                    =   标刻(F2)
IDC_CHECK_CONTINUOUS               =   连续加工
IDC_CHECK_SELECT                   =   选择加工
IDC_STATIC_PART                    =   零件
IDC_STATIC_TOTAL                   =   总数
IDC_BUTTON_POWERON                 =   电源开
IDC_BUTTON_PARAM                   =   参数(F3)

##参数DLG
IDC_CHK_DEFAULT_PARAM              =   使用默认参数
IDC_STATIC_CUR_PEN                 =   当前笔号
IDC_STATIC_MACHINE_COUNT           =   加工数目
IDC_STATIC_RUN_SPEED               =   速度
IDC_STATIC_LASER_POWER             =   功率
IDC_STATIC_LASER_HZ                =   频率(KHZ)
IDC_STATIC_ZKB                     =   脉宽(ns)
IDC_STATIC_OPEN_DELAY              =   开光延时(us)
IDC_STATIC_SHUT_DELAY              =   关光延时(us)
IDC_STATIC_END_DELAY               =   结束延时(us)
IDC_STATIC_CORNER_DELAY            =   拐角延时(us)
IDC_STATIC_STEP_DELAY              =   步间延时(us)
IDC_ADVANCE                        =   高级
IDC_STATIC_PARNM                   =   参数名称
IDC_LOAD_DEFAULT                   =   读取原有参数
IDC_SAVE                           =   保存当前参数
IDC_SAVE_DEFAULT                   =   保存为默认参数
IDS_DEFAULT_PARAM                  =   使用默认参数
##陈列DLG
DLG_MATR_TITLE                     =   阵列
IDC_GROUPBOX_ARRAY                 =   阵列类型
IDC_RADIO_RECTANGLE                =   矩阵
IDC_RADIO_CIRCLE                   =   圆阵

##
IDC_STATIC_MATNUM                  =   阵列数目
IDC_STATIC_MATDIA                  =   半径
IDC_STATIC_MATSTANGLE              =   开始角度
IDC_STATIC_MATAGDIT                =   角度间距
IDC_RADIO_DIRECTION                =   向心
IDC_RADIO_DIRECTION2               =   正向

##
IDC_HOR_NUM                        =   横向数目
IDC_VER_NUM                        =   纵向数目
IDC_HOR_DIST                       =   横向间距
IDC_VER_DIST                       =   纵向间距
IDC_GROUPBOX_DISTANCE              =   间距计算方法
IDC_RADIO_OP                       =   按偏移距离计算
IDC_RADIO_SP                       =   按图形的间距计算

##
DLG_CHG_TITLE                      =   变换

##
IDC_STATIC_POST                    =   位置
IDC_CHK_RELATIVE_POS               =   相对位置
IDC_BTN_APPLY_COPY                 =   应用到复制对象
IDC_BTN_APPLY                      =   应用
##
IDC_STATIC_ANG                     =   角度
IDC_STATIC_CENT                    =   中心
IDC_CHK_RELATIVE_POS               =   相对中心
##比例                             =
IDC_STATIC_RATIO                   =   比例
IDC_STATIC_OBJECT                  =   对象

##尺寸
IDC_STATIC_SIZE                    =   尺寸
##
IDC_STATIC_SLOPE                   =   倾斜
## 名称 DLG                        =
DLG_NAME_TILTE                     =   名称
##
DLG_BASE_SEL_POS_TITLE             =   选择位置坐标的基准
##
IDC_STATIC_POST                    =   位置
IDC_BTN_TEAM                       =   阵列
IDC_BTN_INPORT                     =   输入端口
##
IDC_STATIC_STARTDEG                =   开始角度
IDC_STATIC_ENDDEG                  =   结束角度

##
DLG_ARR_TITLE                      =   阵列
IDC_STATIC_NUM                     =   数目
IDC_STATIC_INC                     =   增量[毫米]

##
IDC_STATIC_DIA                     =   半径
##
IDC_STATIC_WTM                     =   等待时间
##
IDC_STATIC_MVDST                   =   编码器移动距离
##
IDC_BUTTON_FILL                    =   填充
IDC_BUTTON_BAR_OPTION              =   条码
IDC_STATIC_HEIGHT                  =   高度
IDC_CHECK_VARIABLE_TEXT            =   使能变量文本
IDC_RADIO_TEXT_DISTANCE            =   间距
IDC_STATIC_DISTANCE_CONTROL        =   距离控制
IDC_RADIO_TEXT_DISTANCE2           =   中心距
IDC_BUTTON_ADD                     =   增加
IDC_BUTTON_DEL                     =   删除
IDC_BUTTON_MOVEUP                  =   上移
IDC_BUTTON_MOVEDOWN                =   下移
IDC_BUTTON_MODIFY                  =   修改
##
IDC_STATIC_IOCON                   =   I/O控制条件
IDC_STATIC_TIP                     =   提示消息
IDC_CHK_ENABLE                     =   使能
##
IDC_GROUPBOX_OUTPUT                =   设置输出端口
IDC_STATIC_US                      =   微秒
##
IDC_CHECK_DPI_FIXED                =   固定DPI
IDC_CHECK_GRAY                     =   灰度
IDC_BTN_BMP_PROCESS_EXPAND         =   扩展
IDC_STATIC_DBD                     =   对比度
IDC_STATIC_BRI                     =   亮度
IDC_CHECK_CELL                     =   网点
IDC_STATIC_TRIG                    =   阀值
IDC_CHECK_DUAL_DIRECTION           =   双向扫描
IDC_CHECK_DOT_MODE                 =   打点模式
IDC_CHECK_AD_PT                    =   调整点功率
##
IDC_STATIC_EDN                     =   边数
##
DLG_LX_TITLE                       =   螺旋线
IDC_BUTTON_TYPE                    =   type
IDC_BUTTON_DIR                     =   Direction
IDC_STATIC_PENID                   =   笔号
IDC_STATIC_MINRAD                  =   最小半径
IDC_STATIC_MIN_DIT                 =   最小螺旋线螺距
IDC_STATIC_MAXDIT                  =   最大螺旋线螺距
IDC_STATIC_VAR                     =   螺距变化量
IDC_STATIC_OUTEDG                  =   外边界环数
IDC_STATIC_INNER                   =   内边界环数

##
DLG_SYS_PARA_TITLE                 =   系统参数
##
IDC_CHECK_USEPWD                   =   使用软件必须输入密码
IDC_STATIC_USER                    =   用户
IDC_BUTTON1                        =   增加
IDC_BUTTON4                        =   修改
IDC_BUTTON11                       =   删除
##
IDC_STATIC_KEYBD                   =   键盘
IDC_STATIC_MIDIT                   =   微调距离
IDC_STATIC_BIGRAT                  =   大调整比例
IDC_STATIC_RAT                     =   旋转角度
IDC_STATIC_ORI                     =   回原点方式
IDC_STATIC_INOR                    =   输入回零
##
IDC_STATIC_PORT                    =   端口
IDC_STATIC_BIT                     =   波特率
IDC_STATIC_DATABIT                 =   数据位
IDC_STATIC_STPBIT                  =   停止位
IDC_STATIC_MOD                     =   奇偶校验
IDC_STATIC_CMD                     =   命令
##文本元素对话框                   =
DLG_TXT_ELE_TITLE                  =   文本元素
IDC_STATIC_ELETYPE                 =   元素类型
IDC_RD_FIXTXT                      =   固定文本
IDC_RD_SERTXT                      =   序列号
IDC_RD_DATE                        =   日期
IDC_RD_TIME                        =   时间
IDC_RD_TCP                         =   网络通讯
IDC_RD_COM                         =   串口通讯
IDC_RD_SQL                         =   SQL数据库
IDC_RD_FILE                        =   文件
IDC_RD_KEY                         =   键盘
IDC_CHECK_NO_LEAD_ZERO             =   不使用前导零
IDC_STATIC_TEXT                    =   文本
IDC_GROUP_TEXTTYPE                 =   文本类型
IDC_RADIO_TEXTTYPE                 =   文本
IDC_RADIO_TEXTTYPE2                =   换行符
IDC_RADIO_TEXTTYPE3                =   用户名

##
IDC_STATIC_STINDEX                 =   开始序号
IDC_STATIC_CURINDEX                =   当前序号
IDC_STATIC_ENDINDEX                =   最终序号
IDC_STATIC_INCR                    =   序号增量
IDC_STATIC_PERMK                   =   每个标刻数
IDC_STATIC_MODE                    =   模式
IDC_STATIC_RESET                   =   复位
IDC_STATIC_CURMK                   =   当前标刻数
IDC_CHECK_FILTER_SN                =   过滤以下序号
##
IDC_STATIC_SQLDR                   =   SQL驱动
IDC_STATIC_SRC                     =   数据源
IDC_STATIC_DB                      =   数据库名
IDC_STATIC_ID                      =   用户ID
IDC_STATIC_PWD                     =   密码
IDC_STATIC_SQLCMD                  =   SQL命令
IDC_STATIC_LINE                    =   行号
IDC_STATIC_INC                     =   增量
IDC_CHECK_AUTO_RESET               =   自动复位
IDC_CHECK_READ_ALL                 =   每次读整个文件
##
IDC_STATIC_IPADD                   =   IP地址
IDC_STATIC_PORT                    =   端口号
IDC_STATIC_CMD                     =   命令
IDC_CHECK_UNICODE                  =   Unicode
##
IDC_RADIO1_H24                     =   小时-24
IDC_RADIO2_H12                     =   小时-12
IDC_RADIO3_MIN                     =   分钟
IDC_RADIO4_SEC                     =   秒
IDC_RADIO5_QU                      =   时间段
IDC_STATIC_AM_START                =   AM开始时间
IDC_STATIC_PM_START                =   PM开始时间
##
DLG_PIC_PROP_TITLE                 =   图片属性
IDC_STATIC_PRE                     =   图片预览
IDC_STATIC_FILE                    =   文件

##DLL- 窗口
DLG_FLY_TITLE                      =   飞行标刻设置
IDC_CHECK_FLYMARK                  =   飞行标刻
IDC_CHECK_RISING_EDGE              =   上升沿触发
IDC_FLYRIGHT2LEFT                  =   流水线方向从右到左
IDC_FLYCONTINUEMODE                =   流水线连续模式
IDC_CHECK_SIM_FLY                  =   使能硬件模拟飞行
IDC_STATIC_LAN                     =   线缆标刻
IDC_STATIC_MKDIST                  =   标刻间距
IDC_STATIC_INI                     =   初始移动距离
IDC_STATIC_FLYV                    =   飞行速度系数
IDC_STATIC_UNIT                    =   微米/脉冲
IDC_BTN_COMPUTE                    =   计算
IDC_STATIC_INPUTPORT               =   输入端口
##
DLG_CMP_RATIO_TITLE                =   计算比例
IDC_STATIC_OBSIZE                  =   目标标刻尺寸
IDC_STATIC_FTSIZE                  =   实际标刻尺寸
##
DLG_A_TITLE                        =   电流映射
IDC_STATIC_RAFAT                   =   实际比例(%)
IDC_CHECK_DA                       =   DA map(0-4096)
##
IDC_STATIC_ASPECT                  =   外观
IDC_STATIC_ARE                     =   区域尺寸
IDC_STATIC_OFX                     =   偏移X
IDC_STATIC_OFY                     =   偏移Y
IDC_STATIC_ANGLE                   =   角度
IDC_GALVO_1                        =   振镜1 = x
IDC_GALVO_2                        =   振镜2 = x
IDC_STATIC_GOTO                    =   加工后去指定位置
IDC_NO_MOVE                        =   不移动
IDC_MOVE_TO_CENTER                 =   振镜中心
IDC_MOVE_LEFT_TOP                  =   对象左上角
IDC_MOVE_RIGHT_TOP                 =   对象右上角
IDC_MOVE_RIGHT_BT                  =   对象右下角
IDC_MOVE_LEFT_BT                   =   对象左下角
IDC_MOVE_SEP                       =   指定位置
IDC_STATIC_P1                      =   振镜1
IDC_STATIC_P2                      =   振镜2
IDC_REVERSE1                       =   反向
IDC_STATIC_RATIV                   =   比例
IDC_STATIC_PWD                     =   密码


##
DLG_FLY_SET_TITLE                  =   飞行参数计算
IDC_STATIC_FLY_TIP                 =   请手动控制流水线移动一小段距离;测量该距离并填入运行距离输入框内;点击计算后程序自动计算
IDC_STATIC_LEN                     =   运行距离:
IDC_STATIC_MUL                     =   脉冲量:
IDC_BTN_ZERO_CLEAR                 =   清零
IDC_BTN_CALC_START                 =   开始运动
IDC_BTN_CALC_FINISH                =   结束运动
IDC_BTN_CALC_SPEED                 =   计算速度

##
DLG_FREQ_TITLE                     =   频率
IDC_STATIC_FREQK                   =   频率(KHz)
IDC_STATIC_FARAT                   =   实际比例

##
DLG_PWD_SET_TITLE                  =   密碼

##
DLG_TEST_LAS_TITLE                 =   测试激光
IDC_BTN_LASERON                    =   开激光
IDC_STATIC_FREQ                    =   频率
IDC_STATIC_PW                      =   功率
IDC_STATIC_MUWI                    =   脉冲宽度
IDC_STATIC_ONTM                    =   激光开启时间
##
IDC_STATIC_STMKDEL                 =   开始标刻延时
IDC_STATIC_ENDMKDEL                =   结束标刻延时
IDC_STATIC_MAXPW                   =   最大功率延时
IDC_STATIC_MAXFR                   =   最大频率延时
IDC_STATIC_LASMSL                  =   激光器休眠时间
IDC_STATIC_MAXV                    =   最大速度
IDC_STATIC_MINV                    =   最小速度
IDC_STATIC_BUVMIS                  =   曲线离散误差
IDC_SHOW_START_MARK_DLG            =   显示开始标刻对话框
IDC_ENABLE_CMD_FILE                =   使能执行标刻开始和结束命令文件
IDC_AUTO_RESET_MARK_COUNT          =   自动复位加工次数
IDC_DISABLE_REACH_TOTAL_COUNT      =   加工到指定数目后禁止加工
IDC_ENABLE_POWEROFF_SAVE_FILE      =   断电自动保护文件
IDC_DISABLE_OPTIMIZE               =   禁止连续加工模式的优化模式
IDC_STATIC_TOTM                    =   总加工时间
IDC_STATIC_TOTLJ                   =   总零件数
IDC_ENABLE_ANALOG                  =   使能模拟电流抑制
IDC_ENABLE_OFFLINE                 =   使能离线打标
IDC_STATIC_RPCNT                   =   (重复次数
IDC_USE_STEP_MARK_MODE             =   使用步距标刻模式
IDC_BUTTON_FLY                     =   飞行打标
IDC_BUTTON_REDLIGHT                =   红光指示(F1)
##
IDC_STATIC_STOPPT                  =   停止加工输入端口
IDC_STATIC_STOPTIP                 =   停止加工时的提示消息
IDC_STATIC_DRPORT                  =   门端口
IDC_STATIC_IPORT                   =   输入端口
IDC_STATIC_LAMOT                   =   激光电源输出口
IDC_STATIC_PRT                     =   端口
IDC_STATIC_RDPT                    =   红光指示输出口
IDC_STATIC_OPT                     =   输出端口
IDC_STATIC_INPUT                   =   输入端口
IDC_STATIC_MKOUT                   =   标刻输出口
IDC_STATIC_STPT                    =   开始标刻端口
IDC_CHECK1                         =   开始信号脉冲模式
IDC_STATIC_ROTPT                   =   旋转标刻信号端口

##
DLG_POWER_TITLE                    =   功率设置
IDC_STATIC_PW                      =   功率(%)
IDC_STATIC_FTRT                    =   实际比例(%)

##
DLG_PWDDLL_SET_TITLE               =   密码设置
IDC_STATIC_PWDDLL                  =   密码
##
DLG_REDLT_TITLE                    =   红光指示
IDC_STATIC_RDV                     =   红光速度
IDC_CHECK_ENRD                     =   使能显示轮廓
IDC_CHECK_ENCTWK                   =   使能红光连续加工模式
IDC_STATIC_SIZERTX                 =   尺寸比例X
IDC_STATIC_SIZERTY                 =   尺寸比例Y
IDC_BTN_REDLIGHT_PREVIEW           =   红光预览

##
DLG_CFG_MAK_TITLE                  =   配置参数
##
IDC_STATIC_LASTYPE                 =   激光器类型
IDC_STATIC_PMW                     =   PWM
IDC_CHECK_PWM_OUT                  =   使能PWM信号输出
IDC_STATIC_MAXPWM                  =   最大PWM信号
IDC_STATIC_MINPWM                  =   最小PWM信号
IDC_STATIC_KHZ                     =   KHz
IDC_PWM_POWER_MAP                  =   功率映射
IDC_CHECK_TICKLE                   =   使能预电离
IDC_STATIC_MULW                    =   脉冲宽度
IDC_STATIC_MULFR                   =   脉冲频率
IDC_CHECK_FPK                      =   使能CO2首脉冲抑制
IDC_STATIC_FMPW                    =   首脉冲抑制起始功率
IDC_CHECK_FPK_MODE                 =   使能CO2超脉冲抑制
IDC_STATIC_MNOUT                   =   模拟输出
IDC_POWER_ANGLOG_OUT               =   使能电流输出
IDC_FREQ_ANGLOG_OUT                =   使能频率模拟输出
IDC_ANALOG_FIRSTPULSEKILLER        =   使能模拟的首脉冲抑制
IDC_STATIC_SWITCH                  =   开关
IDC_CHECK_USE_QSWITCH              =   使用数字Q开关驱动器
IDC_CHECK_QSWITCH_OPEN_FPK         =   当首脉冲抑制结束时开Q开关
IDC_STATIC_FMS                     =   首脉冲抑制
IDC_CHECK_FIRSTPULSE_REVERSE       =   脉宽反转
IDC_CHEK_LASM_SIG                  =   不检测激光器反馈信号
IDC_OPEN_MO                        =   开启MO延时
IDC_STATIC_WAVE                    =   波形
IDC_CHECK_PWM_OUT5                 =   连续模式
IDC_STATIC_WTPW                    =   待测功率
IDC_POWER_MAP                      =   电流映射
IDC_FREQ_MAP                       =   频率映射
IDC_BTN_LASER                      =   测试激光
##
DLG_DLLTIP_TITLE                   =   提示
IDC_STATIC_ISSTART                 =   是否开始标刻
##
IDS_ALARM_STATE                    =   设置不检测激光器状态,可能会影响激光器性能!
##
STOP                               =   停止
IDS_WAIT_HOST                      =   WAIT FOR ANSWER...
IDS_REDLIGHT                       =   红光指示中...
##
IDC_STATIC_INTER                   =   交叉处理后
IDC_CHECK_KEEP_ORIGINAL            =   保留原始对象
IDC_CHECK_KEEP_OBJECTIVE           =   保留目标对象
IDC_BTN_HANJIE                     =   焊接于...
##
IDC_STATIC_CUT_LEN                 =   剪除长度
IDC_STATIC_AUTODIT                 =   自动连接间距
IDC_STATIC_MULCP                   =   多图运算
##
IDC_STATIC_INVAL                   =   此次改动将在下次启动时生效
IDC_STATIC_PASTEY3                 =   (注：系数越小,点越多,越平滑)
IDC_STATIC_PASTEY2                 =   平滑系数
IDC_CHK_MULTIMARK                  =   多卡标刻
IDC_CHECK_CORFILE                  =   使用校正文件
IDC_STATIC_FIRSTIN                 =   首脉冲抑制功率增量
IDC_CHECK_START_PULSE              =   开始信号脉冲模式
IDS_CHAR_MODL                      =   十进制;十六进制大写;十六进制小写
IDC_STATIC_DTOFF                   =   日期偏移
BYYEAR                             =   按年
BYMONTH                            =   按月
BYDAY                              =   按天
IDC_ADV_MK_TITLE                   =   高级标刻参数
IDC_STATIC_PARLIB                  =   参数库
IDS_MENU_OPER                      =   操作
IDC_STATIC_AUTOSAVE_DESC           =   每过指定时间间隔将当前数据保存到程序目录下的AutoSave.orz文件中
IDS_INPUT_VALID_NUM                =   请输入一个10--1200之间的数

##Calibrate
IDD_DLG_CAL_LSM                    =   SeaThinking 振镜校正
IDC_STATIC_CAL_PN                  =   校正点数:
IDC_STATIC_CAL_PD                  =   点距:
IDC_RESET                          =   重置
IDC_STA_AREA_SIZE                  =   区域尺寸
IDC_STA_AREA_SIZE2                 =   二次校正尺寸
IDC_MARK_CHECKED                   =   标刻校正图形
IDC_MARK_CROSS                     =   标刻区域线
IDC_MARK_RECT                      =   标刻校正网格
IDC_SAVECOEF                       =   保存校正系数
IDC_OK                             =   关闭
IDC_CAL_HEADER_NO                  =   序号
IDC_CAL_HEADER_XCAL                =   X设定值
IDC_CAL_HEADER_YCAL                =   Y设定值
IDC_CAL_HEADER_XACT                =   X实测值
IDC_CAL_HEADER_YACT                =   Y实测值
MSG_CAL_TIP                        =   校正标刻已完成
MSG_CAL_NEEDSAVE                   =   请先保存校正系数

##IDR_MENU_RPOP
ID_RPOP_REPEAT_COMMAND             =  重复当前命令

IDC_STATIC_TXTANG                  =   文本角度
IDC_STATIC_STOP_SIG                =   停止信号被触发，当前加工被停止!

##提示信息
[TIPS]
ID_FILE_NEW_57600                  =  新建(&N)\n建立新文档\n新建
ID_FILE_OPEN_57601                 =  打开(&O)\n打开一个现有文档\n打开
ID_FILE_CLOSE_57602                =  关闭\n关闭活动文档\n关闭
ID_FILE_SAVE_57603                 =  保存\n保存活动文档\n保存
ID_FILE_SAVE_AS_57604              =  另存为\n将活动文档以一个新文件名保存\n另存为
ID_FILE_PAGE_SETUP_57605           =  页面设置\n改变打印选项\n页面设置
ID_FILE_PRINT_SETUP_57606          =  打印设置\n改变打印机及打印选项\n打印设置
ID_FILE_PRINT_57607                =  打印\n打印活动文档\n打印
ID_FILE_PRINT_PREVIEW_57609        =  打印预览\n显示整页\n打印预览

ID_EDIT_CLEAR_57632                =  删除\n删除被选对象\n删除
ID_EDIT_CLEAR_ALL_57633            =  全部删除\n全部删除\n全部删除
ID_EDIT_COPY_57634                 =  复制\n复制被选对象并将其置于剪贴板上\n复制
ID_EDIT_CUT_57635                  =  剪切\n剪切被选对象并将其置于剪贴板上\n剪切
ID_EDIT_FIND_57636                 =  查找\n查找指定的正文\n查找
ID_EDIT_PASTE_57637                =  粘贴\n插入剪贴板内容\n粘贴
ID_EDIT_REPEAT_57640               =  重复\n重复上一步操作\n重复
ID_EDIT_REPLACE_57641              =  替换\n用不同的正文替换指定的正文\n替换
ID_EDIT_SELECT_ALL_57642           =  选择全部\n选择全部图形对象\n选择全部
ID_EDIT_UNDO_57643                 =  撤消\n撤消最后一步操作\n撤消
ID_EDIT_REDO_57644                 =  重新执行\n重新执行先前已撤消的操作\n重新执行

ID_ZOOM_WNDZOOM_32808              =  窗口缩放\n窗口缩放\n窗口缩放
ID_ZOOM_MOVE_32809                 =  平移\n平移图纸\n平移
ID_ZOOM_ZOOMIN_32810               =  放大\n放大一倍显示\n放大
ID_ZOOM_ZOOMOUT_32811              =  缩小\n视图缩小一倍\n缩小
ID_ZOOM_VIEWALL_32812              =  全部观察\n最大视图观察,所有对象\n全部观察
ID_ZOOM_VIEWSELECTED_32813         =  选取观察\n最大视图观察,所选取对象\n选取观察
ID_ZOOM_VIEWPLACE_32814            =  查看工作区\n查看工作区\n工作区域观察

ID_TOOL_PICK_32787                 =  图形拾取\n图形拾取\n图形拾取
ID_TOOL_ITEMEDIT_32788             =  编辑节点\n编辑图形节点\n编辑图形节点
ID_TOOL_LINE_32789                 =  绘制直线\n绘制直线\n绘制直线
ID_TOOL_CURVE_32790                =  绘制曲线\n绘制曲线\n绘制曲线
ID_TOOL_RECTANGLE_32791            =  绘制矩形\n绘制矩形\n绘制矩形
ID_FILL_SHAPE_32796                =  填充\n填充被选取的对象\n填充                     
ID_TOOL_CIRCLE_32799               =  绘制圆\n绘制圆\n绘制圆
ID_TOOL_ELLIPSE_32800              =  绘制椭圆\n绘制椭圆\n绘制椭圆
ID_TOOL_POLYGON_32801              =  绘制多边形\n绘制多边形\n绘制多边形
ID_TOOL_FONT_32802                 =  绘制文字\n绘制文字\n绘制文字
ID_TOOL_VECTORS_32804              =  矢量文件\n绘制矢量文件\n绘制矢量文件
ID_TOOL_BARCODE_32805              =  绘制条形码\n绘制条形码\n绘制条形码
ID_TOOL_TIMER_32806                =  绘制延时器\n绘制延时器\n绘制延时器
ID_TOOL_INPORT_32807               =  绘制输入口\n绘制输入口\n绘制输入口
ID_TOOL_BMP_32815                  =  图片文件\n绘制图片文件\n绘制图片文件
ID_TOOL_OUTPORT_32816              =  绘制输出口\n绘制输出口\n绘制输出口

ID_GROUP_SHAPE_32862               =  群组\n群组被选取的对象\n群组
ID_UNGROUP_SHAPE_32863             =  解散群组\n解散被选取的群组对象\n解散群组
ID_COMBINE_SHAPE_32864             =  组合\n组合被选取的对象\n组合
ID_UNCOMBINE_SHAPE_32865           =  分离组合\n分离被选取的组合对象\n分离组合

ID_FILE_SYSPARAM_32970             =  系统参数\n配置系统参数\n系统参数

ID_EDIT_SORT_32899                 =  排序\n将选中的多个图形进行路径优化\n排序

IDC_ALIGN_CENTER_32843             = 中心点对齐\n中心点对齐\n中心点对齐
IDC_ALIGN_LEFT_32837               = 左对齐\n左对齐\n左对齐
IDC_ALIGN_RIGHT_32838              = 右对齐\n右对齐\n右对齐
IDC_ALIGN_TOP_32840                = 上对齐\n上对齐\n上对齐
IDC_ALIGN_BOTTOM_32841             = 下对齐\n下对齐\n下对齐
IDC_ALIGN_CENTER_Y_32839           = 居中垂直对齐\n居中垂直对齐\n居中垂直对齐
IDC_ALIGN_CENTER_X_32842           = 居中水平对齐\n居中水平对齐\n居中水平对齐

IDC_LOCK_SHAPE_32844               = 锁定所选对象\n锁定所选对象\n锁定所选对象
IDC_UNLOCK_SHAPE_32847             = 解锁所选对象\n解锁所选对象\n解锁所选对象
IDC_UNLOCK_ALLSHAPE_32848          = 解锁全部对象\n解锁全部对象\n解锁全部对象
IDC_MOVESHAPE_CENTER_32849         = 放置图形于原点\n放置图形于原点\n放置图形于原点
IDC_SEL_BY_PEN_32850               = 按笔号选择\n按笔号选择图形\n按笔号选择
IDC_MIRROR_X_32853                 = X镜像\n水平镜像\nX镜像
IDC_MIRROR_Y_32854                 = Y镜像\n垂直镜像\nY镜像
IDC_GRAPH_PATH_32851               = 显示路径\n显示或隐藏路径\n显示或隐藏路径方向
ID_VIEW_ARROW_32875                = 显示路径\n显示或隐藏路径\n显示或隐藏路径方向

ID_LASER_ROC2_32971                = 360度旋转标刻\n360度旋转标刻\n360度旋角度转标刻
ID_LASER_ROT_CFG_40017             = 旋转配置与检查\n旋转配置\n旋转参数配置与旋转轴检查

IDM_LSM_CALIB_40008                = 拟合检定\n拟合检定\n拟合检定

ID_VIEW_TOOLBAR_16400              = 显示或隐藏系统工具栏\n显示或隐藏系统工具栏\n显示或隐藏系统工具栏
IDR_TOOLBAR_DRAW_139               = 显示或隐藏绘图工具栏\n显示或隐藏绘图工具栏\n显示或隐藏绘图工具栏
ID_VIEW_STATUS_BAR_16401           = 显示或隐藏状态栏\n显示或隐藏状态栏\n显示或隐藏状态栏
IDS_READY_352                      = 就绪\n就绪\n就绪
IDR_TOOLBAR_ASSISTANT_188          = 辅助工具栏。图形锁定、解锁，置于原点等\n辅助工具栏。图形锁定、解锁，置于原点等\n辅助工具栏。图形锁定、解锁，置于原点等
IDR_TOOLBAR_ALIGN_190              = 显示或隐藏对齐工具栏\n显示或隐藏对齐工具栏\n显示或隐藏对齐工具栏
ID_VIEW_RESIZABLEBAR_LIST_32825    = 显示或隐藏对象列表栏\n显示或隐藏对象列表栏\n显示或隐藏对象列表栏
ID_VIEW_RESIZABLEBAR_OBJPROP_32780 = 显示或隐藏对象属性栏\n显示或隐藏对象属性栏\n显示或隐藏对象属性栏
ID_VIEW_RESIZABLEBAR_MARKVALUE_32781 = 显示或隐藏标刻参数栏\n显示或隐藏标刻参数栏\n显示或隐藏标刻参数栏
ID_LOCK_EDGE_40022                   = 锁定侧边栏\n锁定侧边栏\n锁定侧边栏
ID_SNAP_GRID_32869                   = 开启/关闭捕捉网格点\n开启/关闭捕捉网格点\n开启/关闭捕捉网格点
ID_SNAP_GUIDELINE_32916              = 开启/关闭捕捉辅助线\n开启/关闭捕捉辅助线\n开启/关闭捕捉辅助线
ID_SNAP_OBJECT_32868                 = 开启/关闭捕捉对象\n开启/关闭捕捉对象\n开启/关闭捕捉对象
ID_PREIVEW_PATH_32833                = 按次序显示图形的标刻轨迹\n轨迹预览\n轨迹预览
ID_IO_STATE_32981                    = IO状态\nIO状态\nIO状态
ID_MENUITEM_BUILD_GCODE_32892        = 生成标刻脚本GCode\n生成GCode\n生成GCode

[Others]
##
IDS_PORT_DEF_MKPORT                = 该输入端口在开始标刻输入口已定义
IDS_PORT_DEF_RDPORT                = 该输入端口在红光输入口已定义
IDS_DEF_CONFLICT_PORT_OUT          = 输出端口定义冲突，请检查
IDS_DEF_CONFLICT_PORT_IN           = 输入端口定义冲突，请检查
##
IDS_VAR_ADV                        = 高级
IDC_CHK_ENA_SPLIT                  = 使能分割字符串修改指定名称的文本对象
IDC_CHK_MKSELF                     = 标刻自己
IDC_CHK_FIXLEN                     = 使能固定文本宽度
IDC_BTN_ADD                        = 增加
IDC_BTN_ADVDEL                     = 删除
IDC_BTN_ADVMOD                     = 修改
##
IDS_VAR_ADV_PARA                   = 参数
IDC_STATIC_FIRSTPOS                = 在字符串中第一个字符的位置
IDC_STATIC_GETNUM                  = 从字符串中提取的字符总个数
IDC_STATIC_GETNUM2                 = 想要修改字符内容的文本对象名称
##
IDS_FPGA_HD_INFO                   = 板卡信息
IDC_STATIC_CD_VER                  = 版本信息
IDC_CHK_HIG_THRIG                  = 高电平触发
##
IDC_STATIC_JMQ                     = 计米器(m)
IDC_CHECK_INSIDE                   = 文本位于圆弧内侧
##
OPEN_VECTOR_FILE_FAIL              = 不支持的向量文件格式
IDS_SUP_RANGE                      = 坐标超过振镜范围
##
IDS_SOFT_TRIAL_VER                 = 软件为试用版本,请尽快联系供应商获得注册码!
IDS_SOFT_EXPIRE                    = 软件已过试用期,软件将在稍后退出,请联系软件供应商!
IDS_MENU_REG                       = 软件注册
##
IDS_DLG_REG_TITLE                  = 软件注册
IDC_STATIC_CODE                    = 机器码
IDC_STATIC_IN_SERI                 = 输入注册码
IDC_STATIC_HAS_REG                 = 软件已注册
##
IDS_MENU_HELP_DOC                  = 帮助文档
IDS_DLG_INPORT_MARK                = 输入端口打标
IDS_REG_CODE_HASREG                = 注册码已注册
##
IDS_LOCK_SIDE                      = 锁定侧边栏
IDS_CARD_ID_EMPTY                  = 板卡ID为空!
IDS_INVAL_SUP_CODE                 = 无效的注册码,供应商信息不对
IDS_REG_SUC                        = 注册成功
IDS_CARD_INVALID                   = 没有找到板卡
IDC_CHK_SUPSLEN                    = 使能超长打标
IDC_STATIC_SPLSIZE                 = 分割尺寸
IDC_STATIC_OFFSET                  = 补偿间距]
IDS_INVAL_CODE                     = 无效的注册码
##
IDS_QR_CODE_MATRIX                 = 默认|版本1(21*21)|版本2(25*25)|版本3(29*29)|版本4(33*33)|版本5(37*37)|版本6(41*41)|版本7(45*45)|版本8(49*49)|版本9(53*53)|版本10(57*57)|版本11(61*61)
IDS_HANXIN_MATRIX                  = 默认|版本1(23*23)|版本2(25*25)|版本3(27*27)|版本4(29*29)|版本5(31*31)|版本6(33*33)|版本7(35*35)|版本8(37*37)|版本9(39*39)|版本10(41*41)|版本11(43*43)
IDC_STATIC_LEVEL                   = 纠错级别
IDC_STATIC_MATRIX                  = 矩阵
##
IDC_FILE_TXT                       = TXT
IDC_FILE_EXCEL                     = EXCEL
IDC_FILE_NAME                      = 文件名称
IDC_FILE_LIST                      = 字段名称
##
IDC_CHK_LEAK                       = 漏光处理
IDC_CHK_UPDATE                     = 写打标状态到数据库
##
IDS_PWD_SPACE                      = 密码中请勿包括空格键
##
MENU_LAS_FILESMARK                 = 多文件标刻
MENU_ALIGN_EQUAL_HOR               = 图像水平等距
MENU_ALIGN_EQUAL_VER               = 图像垂直等距
##
IDC_STA_RING_COMP_DEC                      = 减速比
IDC_STATIC_BWKFRE                  = 电机启动速度
IDS_FONT_VERM                      = 字符迎着打
IDC_STATIC_MKRES                   = 限制次数
IDC_STATIC_MKRES2                  = 提示信息
##
MENU_LAS_MOVEMARK                  = 移动标刻
IDC_STATIC_MOVEMARK                = 打标方案
IDC_BUTTON_AXIS_PARAM              = 扩展轴参数
IDC_BTN_MOVE_PARAM                 = 移动参数
IDC_BUTTON_RUN                     = 运行
IDC_STATIC_DISTANCE                = 移动距离
IDC_STATIC_RUNING                  = 当前操作
IDC_STATIC_CANMARK                 = 打标方式
IDC_STATIC_TIMES                   = 打标次数
IDC_RADIO_ALIGN_UP                 = 上
IDC_RADIO_ALIGN_DOWN               = 下
IDC_CMB_STATIC_MARK                = 静止打标
IDC_CMB_CANNOT_MARK                = 不打标
IDC_BUTTON_SAVEMARK                = 保存方案
IDC_BUTTON_DELMARK                 = 删除方案
IDC_CHK_MONITOR_PORTS              = 使用复合端口
IDC_STATIC_MOVEMACHINE             = 移动平台
IDC_STATIC_MOVETEST                = 移动测试
IDC_STATIC_TIMESTEP                = 使用时间
IDC_STATIC_RETURNWAY               = 原路返回
IDC_STATIC_BACKZERO                = 循环打标
IDC_STATIC_SETCD                   = 坐标设置
IDC_STATIC_LINELONG                = 边长
IDC_STATIC_ZERO                    = 原点
IDC_STATIC_START                   = 起始点
IDC_STATIC_NOW                     = 当前点
IDC_STATIC_TARGET                  = 目标点
IDC_CMB_RETRUNSTART                = 回起始点
IDC_CMB_GOTOTARGET                 = 到目标点
IDC_STATIC_UNITDISTANCE            = 单位距离
IDC_STATIC_UNITTIME                = 单位时间
IDC_CMB_RESETPIC                   = 刷新
IDC_MEG_GONO                       = 是否继续?
IDC_MEG_OUTLOOPS                   = 目标点超出边界!
IDC_MEG_RETRUNSTART                = 当前点不是起始点,是否移动回起始点?
IDS_MOVING                         = 正在移动
IDS_MOVE_FINISH                    = 移动结束
IDC_STATIC_MARKTIMES               = 完成方案次数
IDC_STATIC_MOVEGALVA               = 移动振镜
IDC_STATIC_MOVEDEVICE              = 移动设备
MENU_LAS_CUTMARK                   = 分割标刻
MENU_LAS_CUTNUM                    = 分割数
IDC_STATIC_LPMM                    = 打标密度(点/毫米)
##
IDS_MAINFRMTIP                     = 锦帛方打标软件
IDC_STATIC_USETIME                 = 离软件使用结束还有%d天
IDS_SYSTEM_TIME_FAIL               = 最新的系统时间与板卡时间不一致,请正确设置系统时间或联系供应商
IDS_SOFT_NOT_USE                   = 软件即将过期，请尽快注册。
##
IDS_USB_COMM_ERROR                 = USB通讯错误
##
IDC_STATIC_FAULT                   = 移动误差
IDC_STATIC_MOVEDIR                 = 移动方向
##
IDC_STATIC_MKLIMIT                 = 打标次数限制
IDC_CHK_GENDIS                     = 非常用参数使能编辑
IDC_CHK_REDPORTCNT                 = 使能端口红光打标 
IDS_SELECT_FILEOUT                 = 文件未指定
IDS_TEXT_HAS_MARKED                = 已标刻过
IDC_CHK_SWITCH_TRIG                = 端口触发打标
##
IDD_TXT_SAVEOUT                    = 输出文本
IDC_CHK_OUT_TXT                    = 加工时输出文本到指定文件
IDC_CHK_OUT_TIME                   = 加工时输出时间到指定文件
IDC_CHK_MARK_FLAG                  = 检查文本是否被标刻过
IDC_STATIC_FILE_OUT                = 文件名称
##
IDS_SET_G_UNIT                     = 单位
IDC_STATIC_PATTERN_RANGE           = 图案范围
IDC_STATIC_FAULT2                  = 错位误差
IDS_OFFLINE_MARK                   = 离线打标中...
##
IDC_CHECK_FIXED                    = 固定分割
IDS_CURVE_DRAW                     = 曲线绘制
IDS_REC_DRAW                       = 矩形绘制
IDS_CIRCLE_DRAW                    = 绘制圆
IDS_ECLLI_DRAW                     = 绘制椭圆
IDS_POLY_DRAW                      = 绘制多边形
IDS_INPORT_DRAW                    = 绘制输入端口
IDS_OUTPORT_DRAW                   = 绘制输出端口
IDS_SORT_DRAW                      = 排序
IDS_TEXT_DRAW                      = 绘制文字
IDS_TBARCODE_DRAW                  = 绘制条形码
IDS_ENCODEDIT_DRAW                 = 绘制编码器移动距离
IDS_DELAY_DRAW                     = 绘制延时器
IDS_POINT_DRAW                     = 绘制点
IDS_LINERIT_DRAW                   = 直线输入(可右键输入坐标)
##
IDC_STATIC_TIP_KEY                 = 提示
IDS_KEYBD_INPUT                    = 请输入要加工的文本
IDC_CHK_FIXTXT                     = 固定字符数
IDC_CHK_KEY_SET                    = 设置笔参数
IDC_CHECK_FIXED                    = 固定分割
##
IDC_STATIC_MINDOTTIME              = 深度
##
IDC_STATIC_STARTPARAM              = 请认真确认右侧参数设置与打标材料是否符合！
ID_DRAW_EXTAXI                     = 扩展轴
IDS_PUL_PERUNIT                    = 脉冲/毫米
IDS_PUL_PERDEG                     = 脉冲/度
IDS_EXT_AXI1                       = 扩展轴1
IDS_EXT_AXI2                       = 扩展轴2
IDC_CHK_ZERO                       = 扩展轴校正零点
IDC_CHK_EXTREL                     = 相对位置
IDC_STATIC_MOVE                    = 移动
IDC_BTN_EXT                        = 扩展
IDC_STATIC_UNITTYPE2               = 每单位脉冲数
IDS_EXT_AXI_BKZERO                 = 扩展轴回零中...
IDS_BKZERO_TIMEOUT                 = 回零超时
IDC_STATIC_FV                      = 流水线速度(cm/s)
IDC_CHK_SWITCH                     = 显示预览
##
IDC_PTMATRIC                       = 点阵字体
IDS_BSL_MATRICFONT                 = SEA  DOT MATRIC
IDC_CHK_CENTER                     = 放置到中心
IDC_CHECK_INVERT_PIC               = 反转
ID_ROTMVMARK                       = 旋转标刻
